Revit 2027 API
View.ViewDirection Property
The direction towards the viewer.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ ViewDirection { get; }
Public ReadOnly Property ViewDirection As XYZ
	Get
public:
property XYZ^ ViewDirection {
	XYZ^ get ();
}
member ViewDirection : XYZ with get
Property Value
XYZ
Remarks
In orthographic views, all objects are projected onto the screen along this direction. In perspective views, the view target point is projected along this direction, but other points are projected towards the eye along different vectors.
See Also
Reference
View Class
Autodesk.Revit.DB Namespace